app/Models/JenisbantuanModel.php

SELECT *
FROM `tbl_jenisbantuan`
---
    public function getJenisBantuan()
    {
        return $this->findAll(); // Atau gunakan metode lain sesuai kebutuhan