app/Models/PipModel.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_danapip`
WHERE `ambil_dibank` = 'Sudah diambil'
AND YEAR(tanggal_sk) = '2024'
SELECT COUNT(*) AS `numrows`
FROM `tbl_danapip`
WHERE `ambil_dibank` = 'Belum diambil'
AND YEAR(tanggal_sk) = '2024'
---
    public function countSiswaByAmbilDibank($tahun)
    {
        $querySudahDiambil = $this->db->table('tbl_danapip')
            ->where('ambil_dibank', 'Sudah diambil')
            ->where('YEAR(tanggal_sk)', $tahun)
            ->countAllResults();

        $queryBelumDiambil = $this->db->table('tbl_danapip')
            ->where('ambil_dibank', 'Belum diambil')
            ->where('YEAR(tanggal_sk)', $tahun)
            ->countAllResults();

SELECT *
FROM `tbl_danapip`
WHERE `ambil_dibank` = 'Sudah diambil'
AND YEAR(tanggal_sk) = '2024'
ORDER BY `kelas` ASC
---
    public function getSiswaSudahDiambil($tahun)
    {
        return $this->db->table('tbl_danapip')
            ->where('ambil_dibank', 'Sudah diambil')
            ->where('YEAR(tanggal_sk)', $tahun)
            ->orderBy('kelas', 'ASC') // Mengurutkan berdasarkan kelas secara menaik
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_danapip`
WHERE `ambil_dibank` = 'Belum diambil'
AND YEAR(tanggal_sk) = '2024'
ORDER BY `kelas` ASC
---
    public function getSiswaBelumDiambil($tahun)
    {
        return $this->db->table('tbl_danapip')
            ->where('ambil_dibank', 'Belum diambil')
            ->where('YEAR(tanggal_sk)', $tahun)
            ->orderBy('kelas', 'ASC') // Mengurutkan berdasarkan kelas secara menaik
            ->get()
            ->getResultArray();