app/Models/UserModel.php

SELECT *
FROM `tbl_user`
---
    public function getUser()
    {
        return $this->findAll();

SELECT *
FROM `tbl_user`
WHERE `username` = 'bantuan-pd@sdnkedungrejo.sch.id'
---
    public function get_data_by_username($username)
    {
        return $this->db->table('tbl_user')
            ->where('username', $username)
            ->get()
            ->getRowArray();